
Процедура НоваяПроцедура(ЯвляетсяЗаявкойНаОплату, ИмяСвойства, ЗначенияСвойства, ОбъектXDTO)
	
	Если ЯвляетсяЗаявкойНаОплату И ИмяСвойства = "recipient"    //@non-nls 
	Тогда //     @fqn
	
		ЗначенияСвойства.Добавить(ОбъектXDTO, "Получатель"); //  @nOn-nls 
	ИначеЕсли ТипЗнч(ОбъектXDTO[ИмяСвойства]) = Тип("СписокXDTO")
	  
	Тогда // @noN-nls-1
		Для //@form 
		Каждого ЭлементСпискаXDTO 
		//@non-nls
		Из ОбъектXDTO[ИмяСвойства] Цикл
			
			ЗначенияСвойства.Добавить("ыва"); //@non-Nls			
			ЗначенияСвойства.Добавить("Литерал"); //@non-nLs
			
		КонецЦикла; 
	Иначе
		ЗначенияСвойства.Добавить(ОбъектXDTO[ИмяСвойства]);
	КонецЕсли;	  
	 
КонецПроцедуры
