Функция Тест()
	Код = "Рез = 1 + 1";

	А = Ложь;
	УстановитьБезопасныйРежим(А);
	Выполнить(Код);	

	А = Истина; 
	УстановитьБезопасныйРежим(А);
	Выполнить(Код);	

	УстановитьБезопасныйРежим(ВернутьБулево());
	Выполнить(Код);	

	УстановитьБезопасныйРежим(ВернутьБулево2());
	Выполнить(Код);	

	УстановитьБезопасныйРежим(НЕ А);
	Выполнить(Код);

	УстановитьБезопасныйРежим(А И Истина);
	Выполнить(Код);

КонецФункции

Функция ВернутьБулево()

	Вернуть Истина;

КонецФункции

Функция ВернутьБулево2()

	Вернуть Ложь;

КонецФункции