Функция Тест()
	Код = "Рез = 1 + 1";
	УстановитьБезопасныйРежим(Ложь);
	Выполнить(Код);
	a = Вычислить(Код);
	
	Попытка
		SetSafeMode(True);
		Выполнить(Код);
	Исключение
		а = 1 + Вычислить(Код);
		SetSafeMode(True);
	КонецПопытки;
	
	Выполнить(Код);
	а = а + Вычислить(Код);
		
	Если 1 > 0 Тогда
		Для Счетчик = 1 По 5 Цикл
			а = 1 + Вычислить(Код);
		КонецЦикла;
	ИначеЕсли 1 = 0 Тогда
		Выполнить(Код);
	Иначе
		SetSafeMode(False);
		а = 1 + Вычислить(Код);
	КонецЕсли;
	
	Выполнить(Код);
	а = а + Вычислить(Код);
	
	Если 1 > 0 Тогда
		Для Счетчик = 1 По 5 Цикл
			УстановитьБезопасныйРежим(Истина);
		КонецЦикла;
	Иначе
		УстановитьБезопасныйРежим(Истина);
	КонецЕсли;

	Execute(Код);
	а = 1 + Eval(Код);
КонецФункции