
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_НаименованиеПриИзмененииПосле(Элемент)

	описание = новый ОписаниеОповещения("дляОписания", ЭтотОбъект); 
	
	описание = новый ОписаниеОповещения("дляОписанияИзРасширения", ЭтотОбъект); 
	
	описание = новый ОписаниеОповещения("дляОписанияИзРасширенияНеЭкспорт", ЭтотОбъект); 
	
	описание = новый ОписаниеОповещения("ДляВызоваИзОписанияОповещения", ОбщийМодуль1); 
	
	описание = новый ОписаниеОповещения("ДляВызоваИзОписанияОповещения", ОбщийМодуль1.ЭтотОбъект); 
	
	описание = новый ОписаниеОповещения("СамВРасширенииДляВызоваИзОписанияОповещения", ОбщийМодуль1); 
	
	описание = новый ОписаниеОповещения("СамВРасширенииДляВызоваИзОписанияОповещения", ОбщийМодуль1.ЭтотОбъект);
	 
	описание = новый ОписаниеОповещения("ДляВызоваИзОписанияОповещенияНеЭкспорт", ОбщийМодуль1);
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура дляОписанияИзРасширения() Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура дляОписанияИзРасширенияНеЭкспорт()
	
КонецПроцедуры