Перем ИмяПромежуточногоФайла1;

Процедура ТестУдалитьПромежуточныйФайл1()
    
    Попытка
       УдалитьФайлы(ИмяПромежуточногоФайла1);
    Исключение
       ЗаписьЖурналаРегистрации(НСтр("ru = 'Мой механизм.Действие'"), УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    КонецПопытки;
    
КонецПроцедуры

Процедура ТестСоздатьПромежуточныйФайл1()
    
    ИмяПромежуточногоФайла1 = ПолучитьИмяВременногоФайла("xml");
    Данные.Записать(ИмяПромежуточногоФайла);
    
КонецПроцедуры

Процедура ТестНачатьУдалениеФайлов()
    
    ИмяПромежуточногоФайла2 = ПолучитьИмяВременногоФайла("xml");
    Данные.Записать(ИмяПромежуточногоФайла2);
    
    Попытка
       НачатьУдалениеФайлов(ИмяПромежуточногоФайла2);
    Исключение
       ЗаписьЖурналаРегистрации(НСтр("ru = 'Мой механизм.Действие'"), УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    КонецПопытки;
    
КонецПроцедуры

Процедура ТестПереместитьФайл()
    
    ИмяПромежуточногоФайла3 = ПолучитьИмяВременногоФайла("xml");
    Данные.Записать(ИмяПромежуточногоФайла3);
    
    Попытка
       ПереместитьФайл(ИмяПромежуточногоФайла3);
    Исключение
       ЗаписьЖурналаРегистрации(НСтр("ru = 'Мой механизм.Действие'"), УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    КонецПопытки;
    
КонецПроцедуры

Процедура ТестМоеУдалениеФайла()
    
    ИмяПромежуточногоФайла4 = ПолучитьИмяВременногоФайла("xml");
    Данные.Записать(ИмяПромежуточногоФайла4);
    
    Попытка
       МоеУдалениеФайла(ИмяПромежуточногоФайла4);
    Исключение
       ЗаписьЖурналаРегистрации(НСтр("ru = 'Мой механизм.Действие'"), УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    КонецПопытки;
    
КонецПроцедуры

Процедура ТестСоздатьИНеУдалить()
    
    ИмяПромежуточногоФайла5 = ПолучитьИмяВременногоФайла("xml");
    Данные.Записать(ИмяПромежуточногоФайла4);
    
КонецПроцедуры

Procedure TestDeleteFilesEn()
    
    IntermediateFileName1 = GetTempFileName("xml");
    Data.Write(IntermediateFileName1);
    
    Try
        DeleteFiles(IntermediateFileName1);
    Exception
        ShowMessageBox(,NStr("en = 'Delete file error'"));
    EndTry;

EndProcedure

Procedure TestBeginDeletingFilesEn()
    
    IntermediateFileName2 = GetTempFileName("xml");
    Data.Write(IntermediateFileName2);
    
    Try
        BeginDeletingFiles(IntermediateFileName2);
    Exception
        ShowMessageBox(,NStr("en = 'Delete file error'"));
    EndTry;

EndProcedure

Procedure TestBeginDeletingFilesEn()
    
    IntermediateFileName3 = GetTempFileName("xml");
    Data.Write(IntermediateFileName3);
    
    Try
        MoveFile(IntermediateFileName3);
    Exception
        ShowMessageBox(,NStr("en = 'Delete file error'"));
    EndTry;

EndProcedure

Procedure TestCreateAndNotDeleteEn()
    
    IntermediateFileName4 = GetTempFileName("xml");
    Data.Write(IntermediateFileName4);
    
EndProcedure
