&НаСервере
Процедура Тест1()
	Код = "Рез = 1 + 1";
	УстановитьБезопасныйРежим(Ложь);
	Выполнить(Код);
	а = Вычислить(Код);
	
	УстановитьБезопасныйРежим(Истина);
	Выполнить(Код);
	а = а + Вычислить(Код);
	
	SetSafeMode(False);
	Execute(Код);
	а = а + Eval(Код);
	
	SetSafeMode(True);
	Execute(Код);
	а = а + Eval(Код);	
КонецПроцедуры

&НаСервере
Функция Тест2()
    Код = "Рез = 1 + 1";
    Выполнить(Код);
    Execute(Код);
    Возврат Вычислить(Код) + Eval(Код);
КонецФункции

&AtServer
Процедура Тест3()
    Код = "Рез = 1 + 1";
    Выполнить(Код);
    Execute(Код);
    а = Вычислить(Код) + Eval(Код);
КонецПроцедуры

&AtServer
Функция Тест4()
    Код = "Рез = 1 + 1";
    Выполнить(Код);
    Execute(Код);
    Возврат Вычислить(Код) + Eval(Код);
КонецФункции

&НаСервереБезКонтекста
Процедура Тест5()
    Код = "Рез = 1 + 1";
    Выполнить(Код);
    Execute(Код);
    а = Вычислить(Код) + Eval(Код);
КонецПроцедуры

&НаСервереБезКонтекста
Функция Тест6()
    Код = "Рез = 1 + 1";
    Выполнить(Код);
    Execute(Код);
    Возврат Вычислить(Код) + Eval(Код);
КонецФункции

&AtServerNoContext
Процедура Тест7()
    Код = "Рез = 1 + 1";
    Выполнить(Код);
    Execute(Код);
    а = Вычислить(Код) + Eval(Код);
КонецПроцедуры

&AtServerNoContext
Функция Тест8()
    Код = "Рез = 1 + 1";
    Выполнить(Код);
    Execute(Код);
    Возврат Вычислить(Код) + Eval(Код);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура Тест9()
    Код = "Рез = 1 + 1";
    а = Вычислить(Код) + Eval(Код);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Тест10()
    Код = "Рез = 1 + 1";
    Возврат Вычислить(Код) + Eval(Код);
КонецФункции

&AtClientAtServerNoContext
Процедура Тест11()
    Код = "Рез = 1 + 1";
    а = Вычислить(Код) + Eval(Код);
КонецПроцедуры

&AtClientAtServerNoContext
Функция Тест12()
    Код = "Рез = 1 + 1";
    Возврат Вычислить(Код) + Eval(Код);
КонецФункции