Процедура Тест()
    
    НачатьТранзакцию();
    Попытка
        
        БлокировкаДанных = Новый БлокировкаДанных;
        ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПриходнаяНакладная");
        ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
        БлокировкаДанных.Заблокировать();
        // чтение или запись данных
        
       ЗафиксироватьТранзакцию();
       
       Сообщить("");
       
    Исключение
        
        ОтменитьТранзакцию();
    
    ВызватьИсключение; // есть внешняя транзакция

    КонецПопытки;
    
КонецПроцедуры