Процедура ПолучитьЗадолженностьКонтрагента(Дата = Неопределено, Контрагент)
КонецПроцедуры

Процедура ПолучитьЗадолженностьКонтрагента2(Контрагент, Дата = Неопределено)
КонецПроцедуры

Процедура ПолучитьЗадолженностьКонтрагента3(Контрагент, Дата)
КонецПроцедуры

Процедура РассчитатьКурсовыеРазницы(Организация, Подразделение = Неопределено, Дата)
КонецПроцедуры

Процедура РассчитатьКурсовыеРазницы2(Организация, Подразделение = Неопределено, Дата = Неопределено)
КонецПроцедуры

Процедура ОтправитьСообщениеПользователю()
КонецПроцедуры