
// Новая процедура. 
// 
// Параметры:
//  ЯвляетсяЗаявкойНаОплату Является заявкой на оплату
//  ИмяСвойства Имя свойства
//  ЗначенияСвойства Значения свойства
//  ОбъектXDTO Объект XDTO
Процедура НоваяПроцедура(ЯвляетсяЗаявкойНаОплату, ИмяСвойства, ЗначенияСвойства, ОбъектXDTO)
	  
	Значение = ""; // Дата1, Число  какое то число 
	// yj dsq    
	 
	Сообщить(Значение);     
	
	Если ЯвляетсяЗаявкойНаОплату И ИмяСвойства = "recipient"    //@non-nls 
	Тогда //     @fqn
	
		ЗначенияСвойства.Добавить(ОбъектXDTO, "Получатель"); //  @nOn-nls 
	ИначеЕсли ТипЗнч(ОбъектXDTO[ИмяСвойства]) = Тип("СписокXDTO")
	  
	Тогда // @noN-nls-1
		Для //@form 
		Каждого ЭлементСпискаXDTO 
		//@non-nls
		Из ОбъектXDTO[ИмяСвойства] Цикл
			
			ЗначенияСвойства.Добавить("ыва"); //@non-Nls			
			ЗначенияСвойства.Добавить("Литерал"); //@non-nLs
			
		КонецЦикла; 
	Иначе
		ЗначенияСвойства.Добавить(ОбъектXDTO[ИмяСвойства]);
	КонецЕсли;	  
	 
КонецПроцедуры
