Процедура ДобавлениеКолонкиИнлайн()

	Товары.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));

КонецПроцедуры

Процедура ДобавлениеКолонкиЧерезПеременную()

	ТипЦены = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	Товары.Колонки.Добавить("Цена", ТипЦены);

КонецПроцедуры

Процедура ПрисваиваниеПоКвалифицированномуДоступу()

	СтрокаТовары = Товары.Добавить();
	СтрокаТовары.Цена = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));

КонецПроцедуры
